In [1]:
import numpy as np
import pandas as pd

In [2]:
df= pd.read_csv("data/attacks.csv", encoding='cp1252')

In [3]:
df.shape

(25723, 24)

In [4]:
df.info() #check out the info of the table

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25723 entries, 0 to 25722
Data columns (total 24 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Case Number             8702 non-null   object
 1   Date                    6302 non-null   object
 2   Year                    6300 non-null   float64
 3   Type                    6298 non-null   object
 4   Country                 6252 non-null   object
 5   Area                    5847 non-null   object
 6   Location                5762 non-null   object
 7   Activity                5758 non-null   object
 8   Name                    6092 non-null   object
 9   Sex                     5737 non-null   object
 10  Age                     3471 non-null   object
 11  Injury                  6274 non-null   object
 12  Fatal (Y/N)             5763 non-null   object
 13  Time                    2948 non-null   object
 14  Species                 3464 non-null   object
 15  Investigator or Source  6285 non-null   object
 16  pdf                     6302 non-null   object
 17  href formula            6301 non-null   object
 18  href                    6302 non-null   object
 19  Case Number.1           6302 non-null   object
 20  Case Number.2           6302 non-null   object
 21  original order          6309 non-null   float64
 22  Unnamed: 22             1 non-null      object
 23  Unnamed: 23             2 non-null      object
dtypes: float64(2), object(22)
memory usage: 4.7+ MB

### dropping all duplicated and empty rows

In [5]:
df.drop_duplicates(inplace= True) #remove all the values duplicated

In [6]:
df.shape

(6312, 24)

In [7]:
df.dropna(how= 'all',inplace= True) #removed all the rows which all the values were NaN.

In [8]:
df.shape

(6311, 24)

In [9]:
df.sample()

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
1409,2007.01.09,09-Jan-2007,2007.0,Unprovoked,AUSTRALIA,New South Wales,Sandbar Beach,Surfing,David Sparkes,M,...,2.4 m shark,"J. Watson, Great Lakes Your Guide",2007.01.09-Sparkes.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2007.01.09,2007.01.09,4894.0,NaN,NaN

### Eliminating all the columns are not useful for the hypothesis and rows without the all data it's necesary

In [10]:
list(df.columns)

['Case Number',
 'Date',
 'Year',
 'Type',
 'Country',
 'Area',
 'Location',
 'Activity',
 'Name',
 'Sex ',
 'Age',
 'Injury',
 'Fatal (Y/N)',
 'Time',
 'Species ',
 'Investigator or Source',
 'pdf',
 'href formula',
 'href',
 'Case Number.1',
 'Case Number.2',
 'original order',
 'Unnamed: 22',
 'Unnamed: 23']

In [11]:
df.drop (labels= ['Case Number',
 'Type',
 'Activity',
 'Name',
 'Sex ',
 'Age',
 'Injury',
 'Fatal (Y/N)',
 'Time',
 'Species ',
 'Investigator or Source',
 'pdf',
 'href formula',
 'href',
 'Case Number.1',
 'Case Number.2',
 'Unnamed: 22',
 'Unnamed: 23',
 'original order'], axis= 1, inplace= True)

### Deleting all the incidents happened before 1946 when the World Tourism Organization was created

In [12]:
df=df[df["Year"]>=1946] #remove the row before the year

In [13]:
df['Year'] = df['Year'].astype('str') # remove the .0 format to have a proper year
df['Year'] = df['Year'].map(lambda x: x.rstrip('.0'))
df['Year'] = df['Year'].astype('int')

In [14]:
df.dropna(subset = ['Country'], inplace=True) # remove all the empty values for country

In [16]:
df['Country'] = df['Country'].apply(lambda x: x.lower())#lowercase to compare later with a list of countries

### Creating a list of countries of the world separing them in between the north and south

In [43]:
l_country= pd.read_csv('data/list_country.csv')
l_country.dtypes

latitude     float64
longitude    float64
name          object
dtype: object

In [50]:
l_country["hemisphere"]=

SyntaxError: invalid syntax (3841001271.py, line 2)

In [47]:
for i in l_country["latitude"]:
    if i > 0.1:
         l_country["hemisphere"]= "North"
    else:
         l_country["hemisphere"]= "South"

<>:6: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
<>:6: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
/var/folders/8p/zy_zh8_j0k926kzhhbp39j9c0000gn/T/ipykernel_83943/2543920185.py:6: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
  l_country["hemisphere"["North"]]
/var/folders/8p/zy_zh8_j0k926kzhhbp39j9c0000gn/T/ipykernel_83943/2543920185.py:6: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
  l_country["hemisphere"["North"]]
/var/folders/8p/zy_zh8_j0k926kzhhbp39j9c0000gn/T/ipykernel_83943/2543920185.py:6: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
  l_country["hemisphere"["North"]]
/var/folders/8p/zy_zh8_j0k926kzhhbp39j9c0000gn/T/ipykernel_83943/2543920185.py:6: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
  l_country["hemisphere"["North"]]

TypeError: string indices must be integers

In [18]:
l_country= pd.read_csv('data/list_country.csv')

In [19]:
l_country

      latitude  longitude                  name
0    42.546245   1.601554               Andorra
1    23.424076  53.847818  United Arab Emirates
2    33.939110  67.709953           Afghanistan
3    17.060816 -61.796428   Antigua and Barbuda
4    18.220554 -63.068615              Anguilla
..         ...        ...                   ...
240  15.552727  48.516388                 Yemen
241 -12.827500  45.166244               Mayotte
242 -30.559482  22.937506          South Africa
243 -13.133897  27.849332                Zambia
244 -19.015438  29.154857              Zimbabwe

[245 rows x 3 columns]